In [1]:
import pandas as pd

`// obj = dictionary`
`// array = list`

In [32]:
# dictionary with lists
df1 = pd.DataFrame({ 'x': [1,2,3,4,5], 'y': [9,8,7,6,5]})
df1

   x  y
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [17]:
# list of dictionaries
df2 = pd.DataFrame(
    [
        { 'x': 1, 'y': 9 },
        { 'x': 2, 'y': 8 },
        { 'x': 3, 'y': 7 },
        { 'x': 4, 'y': 6 },
        { 'x': 5, 'y': 5 }
    ]
)
df2

   x  y
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [31]:
# find the index
df1.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
# find the length of the frame
len(df1.index)

5

In [29]:
# find columns
df1.columns

Index(['x', 'y'], dtype='object')

In [28]:
# head finds first row(s)
df1.head(2)

   x  y
0  1  9
1  2  8

In [27]:
# tail finds last row(s)
df1.tail(3)

   x  y
2  3  7
3  4  6
4  5  5

In [26]:
# find values of specific column
df1['x']

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [20]:
# find the location (row) name
df1['x'].loc[0]

1

In [21]:
# find the numerical index value of set
df1['x'].iloc[0]

1

In [23]:
# boolean
df1[df1['x'] > 2]['x']

2    3
3    4
4    5
Name: x, dtype: int64

In [25]:
# swirl it
df1['x'][df1['x'] > 2]

2    3
3    4
4    5
Name: x, dtype: int64

In [35]:
# output to csv
df1.to_csv('example_data.csv')

In [36]:
# copy the dataframe
df3 = df1

In [37]:
# set the value of column y to something different
df3['y'] = [34,45,56,67,78]

In [39]:
# create a new column with values based on column y
df3['z'] = df3['y'] + 3
df3

   x   y   z
0  1  34  37
1  2  45  48
2  3  56  59
3  4  67  70
4  5  78  81

In [43]:
# determine null values
df1.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [46]:
# "list comprehension" - for loop
df3['k'] = [x/2 for x in df3['x']]
df3

   x   y   z    k
0  1  34  37  0.5
1  2  45  48  1.0
2  3  56  59  1.5
3  4  67  70  2.0
4  5  78  81  2.5